"""
Implements Gothic converter
"""

ALPHA_TO_GOTHIC = [
    (r"th", "𐌸"),
    (r"q'", "𐍁"),
    (r"z'", "𐍊"),
    (r"hw", "𐍈"),
    (r"a", "𐌰"),
    (r"b", "𐌱"),
    (r"g", "𐌲"),
    (r"d", "𐌳"),
    (r"e", "𐌴"),
    (r"q", "𐌵"),
    (r"z", "𐌶"),
    (r"h", "𐌷"),
    (r"i", "𐌹"),
    (r"k", "𐌺"),
    (r"l", "𐌻"),
    (r"m", "𐌼"),
    (r"n", "𐌽"),
    (r"j", "𐌾"),
    (r"u", "𐌿"),
    (r"p", "𐍀"),
    (r"r", "𐍂"),
    (r"s", "𐍃"),
    (r"t", "𐍄"),
    (r"w", "𐍅"),
    (r"f", "𐍆"),
    (r"x", "𐍇"),
    (r"o", "𐍉")]
