"""
Implements Ogham converter.
"""

ALPHA_TO_OGHAM = [
    (r",ear,", "ᚕ"),
    (r",or,", "ᚖ"),
    (r",uilleann,", "ᚗ"),
    (r",ifin,", "ᚘ"),
    (r",eam,", "ᚙ"),
    (r",peith, ", "ᚚ"),

    (r"b", "ᚁ"),
    (r"l", "ᚂ"),
    (r"w", "ᚃ"),
    (r"s", "ᚄ"),
    (r"n", "ᚅ"),
    (r"j", "ᚆ"),
    (r"h", "ᚆ"),
    (r"d", "ᚇ"),
    (r"t", "ᚈ"),
    (r"kw ", "ᚊ"),
    (r"k", "ᚉ"),
    (r"cw ", "ᚊ"),
    (r"c", "ᚉ"),
    (r"m", "ᚋ"),
    (r"gw ", "ᚍ"),
    (r"g", "ᚌ"),
    (r"S", "ᚎ"),
    (r"r", "ᚏ"),
    (r"a", "ᚐ"),
    (r"o", "ᚑ"),
    (r"u", "ᚒ"),
    (r"e", "ᚓ"),
    (r"i", "ᚔ"),
    (r">", "᚛"),
    (r"<", "᚜")]
